; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph0 - mode
	image2 - mode
	image5 - mode
	spectrograph1 - mode
	thermograph4 - mode
	spectrograph3 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	Star7 - direction
	GroundStation9 - direction
	Star8 - direction
	GroundStation6 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph1)
	(supports instrument0 image5)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(have_image Star10 spectrograph1)
	(have_image Star10 thermograph4)
	(have_image Phenomenon11 spectrograph1)
	(have_image Star12 spectrograph3)
	(have_image Planet13 thermograph0)
	(have_image Planet13 image2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 phenomenon11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon11)
   goals met: 0 of 6
3. (turn_to satellite0 star8 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 star8)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite0 phenomenon11 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon11)
   goals met: 0 of 6
6. (take_image satellite0 phenomenon11 instrument0 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 1 of 6
7. (turn_to satellite0 planet13 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet13)
   goals met: 1 of 6
8. (take_image satellite0 planet13 instrument0 image2)
   added: (have_image planet13 image2)
   goals met: 2 of 6
9. (take_image satellite0 planet13 instrument0 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 3 of 6
10. (turn_to satellite0 star10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star10)
   goals met: 3 of 6
11. (take_image satellite0 star10 instrument0 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 4 of 6
12. (take_image satellite0 star10 instrument0 thermograph4)
   added: (have_image star10 thermograph4)
   goals met: 5 of 6
13. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 5 of 6
14. (take_image satellite0 star12 instrument0 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 6 of 6
